#+STARTUP: showall inlineimages

* Heading
** Subheading

#+begin_src latex :file latex-logo.png
  \LaTeX
#+end_src

$$ \LaTeX $$

$$ x = y $$


$$ \begin{tabular}{ccc}
left column & middle & right \\ \hline
2 & 3 mm & 2 mm \\
2 & 3 mm & 2 mm \\
2 & 3 mm & 2 mm
\end{tabular}
$$



\begin{equation}
a^2 + b^2 = c^2
\end{equation}

And now, \[15+7=22\],

It is easist to see here. 
\begin{tikzpicture}[scale=0.5, baseline=-3mm, thick]
    \draw (0,0) -- +(0mm,-4.0mm) {
        [yshift=-4mm]
        +(-2mm,0mm) -- +(2mm,0mm)
                +(-1mm,-1mm) -- +(1mm,-1mm)
                +(-0.3mm,-2mm) -- +(0.3mm,-2mm)
        };
    \end{tikzpicture}



\begin{tikzpicture}
\draw (0,0) -- (0,2) -- (2,0)-- (0,0);
\end{tikzpicture}


\begin{tikzpicture}
\begin{scope}[very thick,dashed]
\draw (0,0) circle (.5cm);
\draw (0,0) circle (1cm);
\end{scope}
\draw[thin] (0,0) circle (1.5cm);
\end{tikzpicture}

\begin{tikzpicture}
\draw [gray] (0,1) -- (2,1);
\draw [red] (0, 0.5) -- (2,0.5);
\draw [blue] (0,0) -- (2,0);
\end{tikzpicture}


This is a graph. 


\begin{tikzpicture}
\draw [help lines] (0,0) grid (5,5);
\draw [<->] (5,0) -- (0,0) -- (0,5);
\draw (4,0) -- (0,4);
\draw[dashed,ultra thick]
(1.5,3.5) to [out=-80,in=135] (2.5,1.5);
\draw [dashed,ultra thick]
(2.5,1.5) to [out=-45,in=160] (4.2,0.5);
\end{tikzpicture}

\begin{equation}
     x=\sqrt{b}
\end{equation}
     
If $a^2=b$ and \( b=2 \), then the solution must be
either $$ a=+\sqrt{2} $$ or \[ a=-\sqrt{2} \].



\begin{tikzpicture}
\path [fill=yellow] (0,0) -- (0,5) to [out=-80, in=160]
(3,.8) -- (3,0) -- (0,0);
\draw [<->] (0,6) node [left] {$P$} -- (0,0)
node [below left] {(0,0)} -- (7,0) node [below] {$Q$};
\draw [ultra thick, dashed] (0,.8) node [left] {$P^*=.8$} -- (3,.8)
-- (3,0) node [below] {$Q^*=3$};
\draw [fill] (3,.8) circle [radius=.1];
\draw [thick] (0,5) to [out=-80, in=160] (3,.8) to
[out=-20, in=175] (6,0);
\end{tikzpicture}



\begin{tikzpicture}[->,>=stealth', shorten >=1pt, auto, node distance=2.8cm, semithick]
    \node [astate] (1) at (0,0) {1};
    \node [astate] (2) at (1,0) {2};
    \node [rstate] (3) at (2,0) {3};
    \path (1) edge [bend left] node {b} (2)
          (2) edge node {b} (3)
          (2) edge [bend left] node {a} (1)
          (3) edge [loop above] node {(a, b)} (3);
  \end{tikzpicture}


\begin{tikzpicture}
\draw (-1.5,0) -- (1.5,0);
\draw (0,-1.5) -- (0,1.5);
\draw (0,0) circle (.8cm);
\draw (-1,-1) rectangle (1,1);
\draw[gray] (-.5,-.5) parabola (1,1);
\end{tikzpicture}



\begin{tikzpicture}
\tikzstyle{my help lines}=[gray,thick,dashed]
\draw (0,0) grid (2,2);
\draw[style=my help lines] (2,0)
grid +(2,2);
\end{tikzpicture}




\begin{tikzpicture}[scale=1]\footnotesize
 \pgfmathsetmacro{\xone}{-.4}
 \pgfmathsetmacro{\xtwo}{ 16.4}
 \pgfmathsetmacro{\yone}{-.4}
 \pgfmathsetmacro{\ytwo}{16.4}

\begin{scope}<+->;
% grid
  \draw[step=1cm,gray,very thin] (\xone,\yone) grid (\xtwo,\ytwo);

% ticks
  \foreach \x/\xtext in { 8/\frac{1}{2}, 16/1}
  \draw[gray,xshift=\x cm] (0,.3) -- (0,0) node[below] {$\xtext$};
  \foreach \y/\ytext in {8/\frac{1}{2},16/1}
    \draw[gray, yshift=\y cm] (.3,0) -- (0,0)
    node[left] {$\ytext$};

% origin
 \draw[gray] (0,0) node[anchor=north east] {$O$};

% axes
  \draw[gray,thick,<->] (\xone, 0) -- (\xtwo, 0) node[right] {$x$};
  \draw[gray,thick,<->] (0, \yone) -- (0, \ytwo) node[above] {$y$};
\end{scope}

% function
\begin{scope}[thick,red]
  \foreach \x in {16, 8, 4, 2, 1,.5,.25}
    \draw (16-\x, 16-\x) rectangle (16,16);

  \foreach \x in {16, 8, 4, 2, 1,.5,.25}
  \filldraw[thin,red,opacity=.3] (16-\x, 16-\x)
    rectangle (16-.5*\x,16-.5*\x);

\foreach \x in {16, 8, 4, 2, 1,.5,.25}{
  \filldraw[thin,blue,opacity=.2] (16-\x, 16-.5*\x)
    rectangle (16-.5*\x,16);
  \filldraw[thin,blue,opacity=.2] (16-.5*\x, 16-\x)
    rectangle (16,16-.5*\x);}
\end{scope}
\end{tikzpicture}


** Heading
   
* 

* One

  
* one
   - one
   - two
   - three
     
* 

#+SEQ_TODO: ❢ ☯ ⧖ | ☺ ✔ DEFERRED ✘
* WAITING TODO DONE Clean desk
  


#+TBLFM: @1='(kanban-headers $#)::@2$1..@>$>='(kanban-zero @# $# nil (list (buffer-file-name) "/ssh:localhost:plan.org"))


|  x |  y |
|----+----|
|  1 |  1 |
| 20 | 20 |
#+TBLFM: $2=$1*1
#+TBLFM: $2=$1*2

<2017-10-13 Fri 15:00>

#+SEQ_TODO: TODO(t) STARTED(s) WAITING(w) APPT(a) | DONE(d) CANCELLED(c) DEFERRED(f)




[[file:/home/simplex/Downloads/PythonEssentialReferenceFourthEdition.pdf]]

 
[[file:/home/simplex/Downloads/PythonEssentialReferenceFourthEdition.pdf::100][Page 100]]

[[docview:/home/simplex/Downloads/PythonEssentialReferenceFourthEdition.pdf::100][Page 100]]

https://www.ma.utexas.edu/users/olenab/s12-PutnamInequalitiesQs(3rd).pdf
